АлогистикТест2/src/Documents/алк_РучноеИзменениеДополнительныхПараметровПакета/алк_РучноеИзменениеДополнительныхПараметровПакета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РучноеИзменениеДополнительныхПараметровПакета</name>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШпонаДо</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШпонаПосле</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрипускДо</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрипускПосле</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>СлойДревесиныДо</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </attributes>
  <attributes>
    <name>СлойДревесиныПосле</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭОДо</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭОПосле</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритДо</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритПосле</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДо</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПосле</name>
    <type>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/алк_ДополнительныеПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеПараметрыПакетов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидШпона</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>СлойДревесины</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </resources>
  <resources>
    <name>СортированныйПакет</name>
    <comment>из какого пакета была упаковка</comment>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>УчастокВыпуска</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <resources>
    <name>Досушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_УпаковкаНоменклатуры</types>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
      <types>DocumentRef.алк_РучноеИзменениеПараметровПакета</types>
      <types>DocumentRef.алк_СборкаЗапасов</types>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_РучноеИзменениеДополнительныхПараметровПакета/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Объект.Дата = ТекущаяДата(); 
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьСмену();
КонецПроцедуры 

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УстановитьСмену();
КонецПроцедуры

&НаКлиенте
Процедура СерийныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Если ВыбранноеЗначение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПакетПрошелПроверку(ВыбранноеЗначение,Объект.Дата) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Характеристика) Тогда   
		ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьПараметрыПакетаВопрос",ЭтотОбъект,Новый Структура("ВыбранныйПакет,ПакетДо",ВыбранноеЗначение,Объект.СерийныйНомер))
		,"Данные по пакету будут перезаполнены. Продолжить?",РежимДиалогаВопрос.ОКОтмена,,,"Внимание!");
	Иначе
		ПерезаполнитьПараметрыПакета(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьФормуПоСерийномуНомеру();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСмену() 
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);
		Если ПараметрыСменыПоТекущейДате = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;    	
КонецПроцедуры 

&НаКлиенте
Процедура ПерезаполнитьПараметрыПакетаВопрос(Ответ,ДопПараметры) Экспорт   
	
	Если НЕ Ответ = КодВозвратаДиалога.ОК Тогда
		Объект.СерийныйНомер = ДопПараметры.ПакетДо;
		Возврат;
	КонецЕсли; 
	
	ПерезаполнитьПараметрыПакета(ДопПараметры.ВыбранныйПакет)
	
КонецПроцедуры 

&НаКлиенте
Процедура ПерезаполнитьПараметрыПакета(Пакет)
	
	ПерезаполнитьПараметрыПакетаНаСервере(Пакет);
	
	НастроитьФормуПоСерийномуНомеру();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьНоменклатуруПоКоду(КодНоменклатуры)
	Возврат Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
КонецФункции

&НаСервере
Процедура ПерезаполнитьПараметрыПакетаНаСервере(Пакет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Объем
		|ПОМЕСТИТЬ ВТ_Характеристика
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(&ДатаДокумента, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Характеристика.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Габарит, """") КАК Габарит,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, """") КАК Припуск,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.ВидШпона, """") КАК ВидШпона,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, """") КАК КатегорияНоменклатурыПЭО,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.СлойДревесины, """") КАК СлойДревесины,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Документ, """") КАК Документ,
		|	ВТ_Характеристика.Объем КАК Объем
		|ИЗ
		|	ВТ_Характеристика КАК ВТ_Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(&ДатаДокумента, СерийныйНомер = &СерийныйНомер) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО ВТ_Характеристика.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("СерийныйНомер", Пакет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Характеристика = ВыборкаДетальныеЗаписи.Характеристика; 
		Объект.Объем = ВыборкаДетальныеЗаписи.Объем;
		Объект.ВидШпонаДо = ВыборкаДетальныеЗаписи.ВидШпона;
		Объект.ВидШпонаПосле = ВыборкаДетальныеЗаписи.ВидШпона;
		Объект.ПрипускДо = ВыборкаДетальныеЗаписи.Припуск;
		Объект.ПрипускПосле = ВыборкаДетальныеЗаписи.Припуск;
		Объект.СлойДревесиныДо = ВыборкаДетальныеЗаписи.СлойДревесины;
		Объект.СлойДревесиныПосле = ВыборкаДетальныеЗаписи.СлойДревесины;
		Объект.КатегорияНоменклатурыПЭОДо = ВыборкаДетальныеЗаписи.КатегорияНоменклатурыПЭО;
		Объект.КатегорияНоменклатурыПЭОПосле = ВыборкаДетальныеЗаписи.КатегорияНоменклатурыПЭО;
		Объект.ГабаритДо = ВыборкаДетальныеЗаписи.Габарит;
		Объект.ГабаритПосле = ВыборкаДетальныеЗаписи.Габарит;
		Объект.ДокументДо = ВыборкаДетальныеЗаписи.Документ;
		Объект.ДокументПосле = Объект.Ссылка;
	КонецЦикла; 
	
	Объект.СерийныйНомер = Пакет;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПакетПрошелПроверку(СерийныйНомер,Дата)
	
	Отказ = Ложь;
	Документы.алк_РучноеИзменениеДополнительныхПараметровПакета.ВыполнитьКонтрольИспользованияПакетаВАддендуме(
	СерийныйНомер,
	Дата,
	Отказ);
	
	Документы.алк_РучноеИзменениеДополнительныхПараметровПакета.ВыполнитьКонтрольОстатков(	 
	СерийныйНомер,
	Дата,
	Отказ);

	Возврат НЕ Отказ; 
	
КонецФункции

&НаКлиенте
Процедура НастроитьФормуПоСерийномуНомеру() 
	
	ВидимостьПМ = Номенклатура_ПМ(Объект.СерийныйНомер);
	
	Элементы.ПМ_С.Видимость = ВидимостьПМ;
	Элементы.ПМ_Н.Видимость = ВидимостьПМ;   
	
	Элементы.Шпон_С.Видимость = НЕ ВидимостьПМ;
	Элементы.Шпон_Н.Видимость = НЕ ВидимостьПМ;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция Номенклатура_ПМ(СерийныйНомер)       
	Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СерийныйНомер,"Владелец"); 
	Возврат Номенклатура = ВернутьНоменклатуруПоКоду("ПБ-00000001") //ПМ 
	ИЛИ Номенклатура = ВернутьНоменклатуруПоКоду("ПБ-00000012");  //ПМ СП
КонецФункции

#КонецОбласти
